In [6]:
import pandas as pd 
import numpy as np

# Stacking series on top of one another

In [7]:
# basic method for series and dataframes : series1.append(series2)

In [8]:
# pd.concat([s1,s2,,s3])

In [17]:
s1=pd.Series([1,2,8,4])
s2=pd.Series([2,1,4,8])
s3=pd.Series([3,2,7,1])
s4=pd.Series([5,8,9,4])

In [18]:
pd.concat([s1,s2,s3,s4])

0    1
1    2
2    8
3    4
0    2
1    1
2    4
3    8
0    3
1    2
2    7
3    1
0    5
1    8
2    9
3    4
dtype: int64

In [24]:
x = s1.append(s2)

In [25]:
x

0    1
1    2
2    8
3    4
0    2
1    1
2    4
3    8
dtype: int64

In [26]:
x.index

Int64Index([0, 1, 2, 3, 0, 1, 2, 3], dtype='int64')

In [27]:
x.loc[3]

3    4
3    8
dtype: int64

In [30]:
y=x.reset_index(drop=True)

In [31]:
y

0    1
1    2
2    8
3    4
4    2
5    1
6    4
7    8
dtype: int64

### Using concat

In [32]:
x=pd.concat([s1,s2])

In [33]:
x

0    1
1    2
2    8
3    4
0    2
1    1
2    4
3    8
dtype: int64

In [34]:
x.index

Int64Index([0, 1, 2, 3, 0, 1, 2, 3], dtype='int64')

In [35]:
x.loc[3]

3    4
3    8
dtype: int64

In [36]:
y=x.reset_index(drop=True)

In [37]:
y

0    1
1    2
2    8
3    4
4    2
5    1
6    4
7    8
dtype: int64

In [38]:
y.index

RangeIndex(start=0, stop=8, step=1)

In [39]:
# ignoring index altogether

In [40]:
x=pd.concat([s1,s2],ignore_index=True)

In [41]:
x

0    1
1    2
2    8
3    4
4    2
5    1
6    4
7    8
dtype: int64

In [42]:
# append() is a specific case of pd.concat method

In [44]:
pd.concat([x,s2],axis="columns")

   0    1
0  1  2.0
1  2  1.0
2  8  4.0
3  4  8.0
4  2  NaN
5  1  NaN
6  4  NaN
7  8  NaN

# Concatenating Dataframes

In [48]:
bronze=pd.read_csv("../datasets/bronze.csv",index_col='Country')

In [49]:
silver=pd.read_csv("../datasets/silver.csv", index_col='Country')

In [50]:
gold=pd.read_csv("../datasets/gold.csv",index_col="Country")

In [51]:
bronze

                Total
Country
United States    1052
Soviet Union      584
United Kingdom    505
France            475
Germany           454

In [52]:
silver

                Total
Country
United States    1195
Soviet Union      627
United Kingdom    591
France            461
Italy             394

In [53]:
gold

                Total
Country
United States    2088
Soviet Union      838
United Kingdom    498
Italy             460
Germany           407

In [55]:
pd.concat([bronze,silver,gold],axis="columns",sort=False) # Same as cbind

                 Total   Total   Total
United States   1052.0  1195.0  2088.0
Soviet Union     584.0   627.0   838.0
United Kingdom   505.0   591.0   498.0
France           475.0   461.0     NaN
Germany          454.0     NaN   407.0
Italy              NaN   394.0   460.0

In [56]:
bronze.append(silver)

                Total
Country
United States    1052
Soviet Union      584
United Kingdom    505
France            475
Germany           454
United States    1195
Soviet Union      627
United Kingdom    591
France            461
Italy             394

In [59]:
bronze.columns=['bronze']

In [61]:
silver.columns=['silver']
gold.columns=['gold']

In [62]:
bronze.append(silver)

/Users/actify/environments/py_ds/lib/python3.6/site-packages/pandas/core/frame.py:7138: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

                bronze  silver
Country
United States   1052.0     NaN
Soviet Union     584.0     NaN
United Kingdom   505.0     NaN
France           475.0     NaN
Germany          454.0     NaN
United States      NaN  1195.0
Soviet Union       NaN   627.0
United Kingdom     NaN   591.0
France             NaN   461.0
Italy              NaN   394.0

In [64]:
pd.concat([bronze,silver],axis='rows')

/Users/actify/environments/py_ds/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

                bronze  silver
Country
United States   1052.0     NaN
Soviet Union     584.0     NaN
United Kingdom   505.0     NaN
France           475.0     NaN
Germany          454.0     NaN
United States      NaN  1195.0
Soviet Union       NaN   627.0
United Kingdom     NaN   591.0
France             NaN   461.0
Italy              NaN   394.0

In [65]:
pd.concat([bronze,silver],axis='columns')

/Users/actify/environments/py_ds/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

                bronze  silver
France           475.0   461.0
Germany          454.0     NaN
Italy              NaN   394.0
Soviet Union     584.0   627.0
United Kingdom   505.0   591.0
United States   1052.0  1195.0

In [66]:
bronze

                bronze
Country
United States     1052
Soviet Union       584
United Kingdom     505
France             475
Germany            454

In [69]:
pd.concat([bronze,silver],axis='columns',ignore_index=True)

/Users/actify/environments/py_ds/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

                     0       1
France           475.0   461.0
Germany          454.0     NaN
Italy              NaN   394.0
Soviet Union     584.0   627.0
United Kingdom   505.0   591.0
United States   1052.0  1195.0

In [71]:
# Concatening dataframes by columns or cbind basically does an OUTER JOIN

In [72]:
bronze

                bronze
Country
United States     1052
Soviet Union       584
United Kingdom     505
France             475
Germany            454

In [73]:
silver

                silver
Country
United States     1195
Soviet Union       627
United Kingdom     591
France             461
Italy              394

In [77]:
# OUTER JOIN
pd.concat([bronze,silver],axis='columns', sort=False)

                bronze  silver
United States   1052.0  1195.0
Soviet Union     584.0   627.0
United Kingdom   505.0   591.0
France           475.0   461.0
Germany          454.0     NaN
Italy              NaN   394.0

In [78]:
pd.concat([bronze,silver],axis='columns', join="inner")

                bronze  silver
Country
United States     1052    1195
Soviet Union       584     627
United Kingdom     505     591
France             475     461

In [79]:
pd.concat([bronze,silver],axis='columns', join="outer")

/Users/actify/environments/py_ds/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

                bronze  silver
France           475.0   461.0
Germany          454.0     NaN
Italy              NaN   394.0
Soviet Union     584.0   627.0
United Kingdom   505.0   591.0
United States   1052.0  1195.0

In [85]:
bronze.pct_change(3)

                  bronze
Country
United States        NaN
Soviet Union         NaN
United Kingdom       NaN
France         -0.548479
Germany        -0.222603

In [83]:
bronze

                bronze
Country
United States     1052
Soviet Union       584
United Kingdom     505
France             475
Germany            454

In [86]:
pd.melt()

-0.5484790874524715

In [88]:
s1.set

NameError: name 'set_index' is not defined

In [89]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [90]:
s1.set_index()

AttributeError: 'Series' object has no attribute 'set_index'